#include <stdio.h>
#include <stdlib.h>
#include <locale.h>


int main(int argc, char *argv[]) {
	setlocale(LC_ALL,"Turkish");
	int a,b,c;
	printf("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
	printf("Fonksiyon ile \"HUSEYIN\" cizme:");
	printf("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
	
	for(a=0; a<363; a++){
		if(a%33==0){
			printf("\n");
		}
		b=a%33; //sutun
		c=a/33; //satir
		
		if(b==1 && c>=2 && c<=8 || b==4 && c>=2 && c<=8 || c==5 && b>=1 && b<=4){
			printf(" @ ");  // H cizimi
		}
		else if(b==6 && c>=5 && c<=8 || b==9 && c>=5 && c<=8 || c==8 && b>=6 && b<=9 || c==3 && b%33==6 || c==3 && b%33==9 ){
			printf(" @ ");  // Ü cizimi
		}
		else if(c==4 && b>=11 && b<=13 || c==6 && b>=11 && b<=13 || c==8 && b>=11 && b<=13 || c==5 && b%33==11 || c==7 && b%33==13){
			printf(" @ ");  // S cizimi
		}
		else if(c==4 && b>=15 && b<=18 || b==15 && c>=4 && c<=8 || c==6 && b>=15 && b<=18 || c==8 && b>=15 && b<=18){
			printf(" @ ");  // E cizimi
		}
		else if(b==20 && c>=4 && c<=6 || b==23 && c>=4 && c<=8 || c==6 && b>=20 && b<=23 || c==8 && b>=20 && b<=23){
			printf(" @ ");  // Y cizimi
		}
		else if(b==25 && c>=5 && c<=8 || c==3 && b%33==25){
			printf(" @ ");  // Ý cizimi
		}
		else if(b==27 && c>=4 && c<=8 || b==31 && c>=4 && c<=8 || c==5 && b%33==28 || c==6 && b%33==29 || c==7 && b%33==30){
			printf(" @ ");  // N cizimi
		}
		else{
			printf(" . ");
		}
	}
	
	printf("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
	printf("Fonksiyon Ýle \"KEREM\" cizme:");
	printf("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n"); 
	
	int d,e,f;
	
	for(d=0; d<300; d++){
		if(d%30==0){
			printf("\n");
		}
		
		e=d%30;  //sutun
		f=d/30;  //satir
		
		if(e==1 && f>=3 && f<=7 || e+f==7 && f>=3 && f<=5 ||f==6 && e%30==3 || f==7 && e%30==4){
			printf(" @ ");  // K cizimi
		}
		else if(e==6 && f>=3 && f<=7 || f==3 && e>=6 && e<=9 || f==5 && e>=6 && e<=9 || f==7 && e>=6 && e<=9){
			printf(" @ ");  // E cizimi
		}
		else if(e==11 && f>=3 && f<=7 || f==3 && e>=11 && e<=14 || f==5 && e>=11 && e<=14 || f==4 && e%30==14 ||
		 f==6 && e%30==13 || f==7 && e%30==14){
		 	printf(" @ ");  // R cizimi
		 }
		else if(e==16 && f>=3 && f<=7 || f==3 && e>=16 && e<=19 || f==5 && e>=16 && e<=19 || f==7 && e>=16 && e<=19){
			printf(" @ ");  // E cizimi
		}
		else if(e==21 && f>=3 && f<=7 || e==28 && f>=3 && f<=7 || f==4 && e%30==22 || f==5 && e%30==23 || f==6 && e%30==24 ||
		f+e==31 && f>=3 && f<=6){
			printf(" @ ");  // M cizimi
		}
		else{
			printf(" . ");
		}
	}
	

	return 0;
}
